In [1]:
import pandas as pd
import numpy as np








Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [2]:
# Q1. List any five functions of the pandas library with execution.
# Ans:- read function to load file in dataframe
df = pd.DataFrame({'A':['apple','angle','astronaut','ablility'],'B':['bus','bike', 'bull','basket'], 'C': ['cup','cut', 'cover', 'corner']})
df

           A       B       C
0      apple     bus     cup
1      angle    bike     cut
2  astronaut    bull   cover
3   ablility  basket  corner

In [3]:
# describe function
df.describe(include="all")

            A    B    C
count       4    4    4
unique      4    4    4
top     apple  bus  cup
freq        1    1    1

In [4]:
#  to read first few row
df.head()

           A       B       C
0      apple     bus     cup
1      angle    bike     cut
2  astronaut    bull   cover
3   ablility  basket  corner

In [5]:
# Count function count no of entries
df.A.count()

4

In [6]:
#  this will give unique values
df.A.unique()

array(['apple', 'angle', 'astronaut', 'ablility'], dtype=object)

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
df = pd.DataFrame({'A':['apple','angle','astronaut','ablility'],'B':['bus','bike', 'bull','basket'], 'C': ['cup','cut', 'cover', 'corner']})
df
print(df.size)
print(df.shape)

12
(4, 3)

In [8]:
def reindex_df(df):
    new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    return df.reset_index(drop=True).set_index(new_index)

In [9]:
df = reindex_df(df)
df

           A       B       C
1      apple     bus     cup
3      angle    bike     cut
5  astronaut    bull   cover
7   ablility  basket  corner

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [10]:
df = pd.DataFrame({'Values':[10,20,30,40,50,60,70,80,90,100]})
df

   Values
0      10
1      20
2      30
3      40
4      50
5      60
6      70
7      80
8      90
9     100

In [11]:
def sum_3 (df):
    return int(sum(df.values[0:3]))
sum_3(df)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
df = pd.DataFrame({'Text':['my name is don. who are you','one of the biggest tree in the world is in Africa', 'todays climate is not good, hence i am not going to class' ]})
df

                                                Text
0                        my name is don. who are you
1  one of the biggest tree in the world is in Africa
2  todays climate is not good, hence i am not goi...

In [13]:
df['Word_Count'] = df['Text'].apply(lambda x : len(str(x).split()))

In [14]:
df

                                                Text  Word_Count
0                        my name is don. who are you           7
1  one of the biggest tree in the world is in Africa          11
2  todays climate is not good, hence i am not goi...          12

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [15]:
df = pd.DataFrame({'A':[1,2,3,4],'B':['bus','bike', 'bull','basket'], 'C': ['cup','cut', 'cover', 'corner']})
print(df.size)
print(df.shape)

12
(4, 3)

Ans:- df.size gives total number of elements that is product of row and columns, where df.shape gives the shape of the dataframe that is no of rows and columns





Q6. Which function of pandas do we use to read an excel file?

In [16]:
df = pd.read_excel('Data_train.xlsx')
df

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302
...,...,...,...,...,...,...,...,...,...,...,...
10678,Air Asia,9/04/2019,Kolkata,Banglore,CCU → BLR,19:55,22:25,2h 30m,non-stop,No info,4107
10679,Air India,27/04/2019,Kolkata,Banglore,CCU → BLR,20:45,23:20,2h 35m,non-stop,No info,4145
10680,Jet Airways,27/04/2019,Banglore,Delhi,BLR → DEL,08:20,11:20,3h,non-stop,No info,7229
10681,Vistara,01/03/2019,Banglore,New Delhi,BLR → DEL,11:30,14:10,2h 40m,non-stop,No info,12648
10682,Air India,9/05/2019,Delhi,Cochin,DEL → GOI → BOM → COK,10:55,19:15,8h 20m,2 stops,No info,11753

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [17]:
df = pd.DataFrame({'Email': ['rohitsainidtu@gmail.com', 'ciya@piya.com', 'laddu@paddu.com', 'gama@lambda.com']})

In [18]:
def user (df):
    df['Username'] = df.Email.apply(lambda x : x.split('@')[0])
    return df
user(df)

                     Email       Username
0  rohitsainidtu@gmail.com  rohitsainidtu
1            ciya@piya.com           ciya
2          laddu@paddu.com          laddu
3          gama@lambda.com           gama

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [19]:
df = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1], 'C':[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [20]:
df[ (df.A >5) & (df.B <10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2


Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [21]:
df = pd.DataFrame({'Values':[3,8,6,2,9,33,44,24,5]})
df

   Values
0       3
1       8
2       6
3       2
4       9
5      33
6      44
7      24
8       5

In [22]:
def Mmsd (df):
    mean = df.Values.mean()
    median = df.Values.median()
    sd = df.Values.std()
    return  mean, median, sd

In [23]:
Mmsd(df)

(14.88888888888889, 8.0, 15.103347678945589)

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [24]:
def MovingAverage(df):
    # Convert the 'Date' column to a datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Sort the DataFrame by date in ascending order
    df = df.sort_values('Date')
    
    # Calculate the moving average using a window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

In [25]:
df = pd.DataFrame({'Date':['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05','2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10']})
df['Sales']= [1,2,3,4,5,6,7,8,9,10]
def ma (df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df
ma(df)

         Date  Sales  MovingAverage
0  2023-01-01      1            1.0
1  2023-01-02      2            1.5
2  2023-01-03      3            2.0
3  2023-01-04      4            2.5
4  2023-01-05      5            3.0
5  2023-01-06      6            3.5
6  2023-01-07      7            4.0
7  2023-01-08      8            5.0
8  2023-01-09      9            6.0
9  2023-01-10     10            7.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [26]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [27]:
df['Date'] = pd.to_datetime(df['Date'])

df['day_of_week'] = df['Date'].dt.day_name()
df

        Date day_of_week
0 2023-01-01      Sunday
1 2023-01-02      Monday
2 2023-01-03     Tuesday
3 2023-01-04   Wednesday
4 2023-01-05    Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [28]:
df = pd.DataFrame({'Date': ['2023-01-05 00:00:00', '2022-01-02 12:34:56', '2022-01-03 23:59:59']})
df['Date'] = pd.to_datetime(df['Date'])
df[(df.Date >'2023-01-01') & (df.Date <'2023-01-31')]

        Date
0 2023-01-05

In [29]:
df.Date <'2023-01-31'

0    True
1    True
2    True
Name: Date, dtype: bool

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans:- import pandas is the foremost necessary libary that needs to be imported